// pages/charge/charge.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    listData: [{
        "type": "箱货车 3吨 起步价",
        "cost": "350元/车"
      },
      {
        "type": "大卡车 3吨 起步价",
        "cost": "350元/车"
      },
      {
        "type": "中性卡车 2吨 起步价",
        "cost": "300元/车"
      },
      {
        "type": "金杯车 2吨 起步价",
        "cost": "260元/车"
      },
      {
        "type": "面包车 1.5吨 起步价",
        "cost": "200元/车"
      }
    ],
    listData00: [{
        "type": "楼层费",
        "cost": "无电梯或不能使用电梯搬运时，含二层以上,每上、下一层加收楼层费每层30元，从第七层 开始每层加收50元； 有电梯时，搬出或搬入地，每车次加收二次装卸费各50元"
      },
      {
        "type": "途中装卸费",
        "cost": "每多装卸一个地点加收50元"
      },
      {
        "type": "超公里费",
        "cost": "搬出与搬入地点实际距离超过十公里以后，每超出一公里加收8元"
      },
      {
        "type": "平面搬运距离费",
        "cost": "需要人工平面搬运距离超过十米时，每超1米每车次加收2元"
      },
      {
        "type": "晚间服务费",
        "cost": "22：00以后,每车次加收100元。"
      },
      {
        "type": "延误工时费",
        "cost": "因客户原因造成作业车组到位后不能工作延误工时，每小时加收100元"
      },
      {
        "type": "空驶费",
        "cost": "车辆到位后,客户取消用车时每车次收取空驶费100元"
      }
    ],

    listData01: [{
        "type": "单运钢琴",
        "cost": "型号为120(含)以下时，起价费350元人民币； 型号为120以上时，起价费350元人民币+楼层每层30元"
      },
      {
        "type": "混装钢琴",
        "cost": "钢琴与其它物品混装时，钢琴单独收费350元每台（三角琴除外）+楼层每层30元"
      },
      {
        "type": "其它",
        "cost": "大型复印机、茶台、保险柜、大鱼缸、大镜子、健身器材、42寸(含)以上电视、滚筒洗衣机、对开门冰箱每件加收50—500元不等"
      }
    ],
    listData02: [{
        "type": "床",
        "cost": "简易床每张50元人民币； 高档双人床、液压杆床每张80元人民币"
      },


      {
        "type": "卧室柜",
        "cost": "拆装单开门30元/门、推拉门60元/门"
      },
      {
        "type": "梳妆台",
        "cost": "50元/个"
      },
      {
        "type": "会议桌",
        "cost": "1.8米以上大型会议桌每张100元人民币"
      },
      {
        "type": "拆装办公隔断",
        "cost": "22：00以后，每车次加收100元。"
      },
      {
        "type": "延误工时费",
        "cost": "50元/个"
      },
      {
        "type": "拆装板台、会议桌",
        "cost": "50－150元/个"
      }
    ],
    listData03: [{
        "type": "拆装壁挂机（1.5匹以下）",
        "cost": "100元（单拆60元，单装60元）"
      },


      {
        "type": "拆装柜机（2匹以下）",
        "cost": "150元（单拆80元，单装１００元）"
      },
      {
        "type": "换管",
        "cost": "每米90至120元"
      },
      {
        "type": "加氟",
        "cost": "50至80元（每个压）"
      },
      {
        "type": "打孔",
        "cost": "砖楼30元/个、板楼50元/个、塔楼80元/个"
      }
    ],
    listData04: [{
        "type": "载重量3吨货车",
        "cost": "8元/公里"
      },
      {
        "type": "载重量5吨货车",
        "cost": "10元/公里"
      }
    ],
    listData05: [{
        "type": "载重量3吨货车",
        "cost": "200元/车"
      },
      {
        "type": "载重量5吨货车",
        "cost": "260元/车"
      }
    ]

  },

  onLoad: function() {
    console.log('onLoad')
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})